Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
data = [ 4, 8, 15, 16, 23, 42]

In [3]:
ser = pd.Series(data)

In [4]:
ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(ser)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
var = ["Tushar", 21, 65.23 , {1,2,3}, "SINGH_RAWAT", "123", 54, 6+5j, 8, 10]

In [7]:
ser1 = pd.Series(var)

In [8]:
ser1

0         Tushar
1             21
2          65.23
3      {1, 2, 3}
4    SINGH_RAWAT
5            123
6             54
7         (6+5j)
8              8
9             10
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

In [10]:
data1 = [["Alice",25,"Female"] , ["Bob",30,"Male"] , ["Claire",27,"Female"]]

In [12]:
df = pd.DataFrame(data1, columns=['Name', 'Age' , 'Gender'])

In [13]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

As noted in the table, a Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. The main distinction between the two is this. For a single-column DataFrame, an index can be optional, but a Series has to have an index defined.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [16]:
df.head() #this function is used to print the first five elements of the dataframe

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
df.tail()  #this function is used to print the last five elements of the dataframe

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [18]:
type(df)   #this will return the type of dataframe

pandas.core.frame.DataFrame

In [19]:
df.columns    #this will return the name of all the columns in the dataframes

Index(['Name', 'Age', 'Gender'], dtype='object')

In [20]:
df['Name']   #by this we can print the data for a specific column

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [21]:
df[['Name','Age']]  #this is how we can access the multiple columns in the dataframe

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

In [22]:
df.dtypes   #this will return the type for the columns or datapoints in the dataframe

Name      object
Age        int64
Gender    object
dtype: object

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

series : immutable     
Dataframes : mutable      
panel : mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [31]:

import pandas as pd
# Create pandas Series
courses = pd.Series(["Data_science","web_dev","Machine_learning"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

# Combine two series.
df = pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df = pd.concat([courses,fees,discount],axis=1)
print(df)

                  0      1     2
0      Data_science  22000  1000
1           web_dev  25000  2300
2  Machine_learning  23000  1000